{
  "author": "Dr Jon Nicholson",
  "about": [
    "Jon is a Principal Solution Architect in the Digital Domain at Hastings Direct, working closely with senior leadershop team to support and drive strategic (and pragmatic) decision making. He has architected many high profile deliveries such as the digital transformation of claim notifications and post-notification handling. This has led to very positive customer engagement (increases in claims reported and managed digitally, without the need to call us) and customer satisfaction (improvements in NPS). Jon has won a number of deparmental awards for his contributions to the company and colleagues.",

    "In a past life, Jon was an academic with a PhD in formal software design and an MSc in distributed information management systems. To date he has published in three high quality journals, 10 international conferences, and contributed to a book. Jon was a Senior Lecturer at the University of Brighton teaching various Computer Science subjects, and was course leader for BSc hons Digital Games Production. He was twice nominated for Excellence in Facilitating and Enhancing Learning awards, and organised Game Jam for students and the public for which he secured sponsorship from Studio Gobo, O'Reilly Media and GOG.com.",

    "At his core, Jon is a seasoned full-stack developer with over 20 years of experience, architecting and building elegant solutions to complex problems."
  ],
  "url": "https://www.drjonnicholson.com",
  "title": "Dr Jon Nicholson FHEA",
  "subtitle": "drjonnicholson.com",
  "headline": "Coder. Architect. Academic. Gamer.",
  "description": "Personal site of Dr Jon Nicholson - Coder. Architect. Academic. Gamer.",
  "keywords": ["Jon Nicholson", "Portfolio", "Resume", "CV", "Publications"],

  "socials": {
    "github": "drjonnicholson",
    "linkedin": "drjonnicholson",
    "twitter": "drjonnicholson"
  },

  "skills": {
    "title": "Skills",
    "defaultSelected": "Click on an icon to learn more",
    "foreword": null,
    "afterword": "... and many more! Don't see what you're looking for? I'm happy to learn!",
    "content": [
      { "text": "HTML5 and web technologies, focussing on W3C standards", "icon": "html" },
      { "text": "CSS including CSS Modules, SASS and LESS", "icon": "css" },
      { "text": "JavaScript in the browser", "icon": "javascript" },
      { "text": "React, although I've used other frameworks like VueJS", "icon": "react" },
      { "text": "NodeJS", "icon": "nodejs" },
      { "text": "Creating NPM packages ", "icon": "npm" },
      { "text": ".NET (C# / ASP / Core / Standard)", "icon": "dotnet" },
      { "text": "Java, a classic 😉", "icon": "java" },
      { "text": "Ruby (Rails)", "icon": "ruby" },
      { "text": "SQL in its various flavours (MySQL / MSSQL / Postgres / SQLite)", "icon": "database" },
      { "text": "GIT (not to mention CVS / Subversion)", "icon": "git" },
      { "text": "Shell scripting (CMD / Powershell / Bash / SH / etc.)", "icon": "scripting" },
      { "text": "API design and development across REST (OpenAPI), JSONRPC (OpenRPC), SOAP, etc.", "icon": "api" }
    ]
  },

  "publications": {
    "title": "Selected publications",
    "highlight": ["J. Nicholson"]
  }
}
